/*
Задача №58: 
Написать программу, которая в двумерном массиве заменяет строки на столбцы или 
сообщить, что это невозможно (в случае, если матрица не квадратная).
*/


Console.Write("Задайте количество строк в массиве: ");
int m = int.Parse(Console.ReadLine());
Console.Write("Задайте количество столбцов в массиве: ");
int n = int.Parse(Console.ReadLine());
if (m != n)
{
    Console.WriteLine("Задана не квадратная матрица, " +
        "невозможно выполнить операцию!");
}
else
{
    int[,] array = new int[m, n];

    void FillArray(int[,] array)
    {
        for (int i = 0; i < array.GetLength(0); i++)
        {
            for (int j = 0; j < array.GetLength(1); j++)
            {
                array[i, j] = new Random().Next(1, 501);
            }
        }
    }
    void PrintArray(int[,] array)
    {
        for (int i = 0; i < array.GetLength(0); i++)
        {
            for (int j = 0; j < array.GetLength(1); j++)
            {
                Console.Write($"{array[i, j]:d3}\t");
            }
            Console.WriteLine();
        }
    }
    void ChangeLineColumn(int[,] array)
    {
        for (int i = 0; i < array.GetLength(0); i++)
        {
            for (int j = i + 1; j < array.GetLength(1); j++)
            {
                int temp = array[i, j];
                array[i, j] = array[j, i];
                array[j, i] = temp;
            }
        }
    }
    FillArray(array);
    PrintArray(array);
    Console.WriteLine("Перевёрнутый массив: ");
    ChangeLineColumn(array);
    PrintArray(array);
}
Console.WriteLine();