// Задача №74: В некотором машинном алфавите имеются четыре буквы «а», «и», «с» и «в». 
// Покажите все слова, состоящие из n букв, которые можно построить из букв этого алфавита.

string[] PrintAbc(char[] abc, int N)
{
    
}
Console.Write("Введите число N: ");
int N = int.Parse(Console.ReadLine());
Console.Write("Введите число B: ");
char[] abc = {'а', 'и', 'с', 'в'};
PrintAbc(abc, N);