// Задача 0: Вывести квадрат числа.

Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());

Console.WriteLine("Квадрат числа " + number + " равен " + number * number + ".");